Revit 2027 API
ParameterTypeId.FabricationProductCode Property
 "Product Code"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductCode { get; }
Public Shared ReadOnly Property FabricationProductCode As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductCode {
	ForgeTypeId^ get ();
}
static member FabricationProductCode : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace